#+title: Referenzimplementierung Transferstelle
Im Folgenden wird eine mögliche Implementierung der Transferstelle beschrieben, die primär auf Schnittstellen im FHIR Format arbeitet.
Die Referenzimplementierung übernimmt die Aufgabe, Daten für eingewilligte Patienten aus den Routinedaten zu extrahieren und diese für das Projekt bereitzustellen.
*** 2.2) Extraktion der Session IDs um zugehörige Patienten abzufragen
In dem erhaltenen SearchSet wird eine Liste von Consent Resourcen zurückgeliefert. Diese kann durch die Transferstelle genutzt werden um die Enthaltenen SESSION IDs zu ermitteln:
#+NAME: identifiers-from-inbox
#+begin_src sh :var data=consents-from-inbox :results output
echo "$data" | jq '[.entry[].resource.patient.identifier]'
#+end_src

#+RESULTS: identifiers-from-inbox
: [
:   {
:     "system": "SESSION_ID",
:     "value": "00VNY0RG"
:   }
: ]
